; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-63)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b4)
    (on b4 b9)
    (on b9 b2)
    (on b2 b1)
    (on b1 b19)
    (on b19 b18)
    (on b18 b12)
    (on-table b12)
    (clear b15)
    (on b15 b5)
    (on-table b5)
    (clear b17)
    (on b17 b8)
    (on b8 b13)
    (on b13 b6)
    (on b6 b11)
    (on b11 b10)
    (on b10 b16)
    (on b16 b3)
    (on b3 b7)
    (on-table b7))
 (:goal (and 
(on-table b15)
(on-table b1)
(on b2 b15)
(on b4 b2)
(on b14 b4)
(on b19 b1)
(on b3 b19)
(on b6 b14)
(on b8 b3)
(on b11 b8)
))
)

; plan
1. (unstack b15 b5)
   deleted: (on b15 b5) (clear b15) (arm-empty)
   added: (holding b15) (clear b5)
   goals met: 1 of 10
2. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 10
3. (unstack b14 b4)
   deleted: (on b14 b4) (clear b14) (arm-empty)
   added: (holding b14) (clear b4)
   goals met: 1 of 10
4. (stack b14 b17)
   deleted: (clear b17) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b17)
   goals met: 1 of 10
5. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 1 of 10
6. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 1 of 10
7. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 1 of 10
8. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 10
9. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 1 of 10
10. (stack b2 b15)
   deleted: (clear b15) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b15)
   goals met: 2 of 10
11. (unstack b1 b19)
   deleted: (on b1 b19) (clear b1) (arm-empty)
   added: (holding b1) (clear b19)
   goals met: 2 of 10
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 10
13. (unstack b19 b18)
   deleted: (on b19 b18) (clear b19) (arm-empty)
   added: (holding b19) (clear b18)
   goals met: 3 of 10
14. (stack b19 b1)
   deleted: (clear b1) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b1)
   goals met: 4 of 10
15. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 4 of 10
16. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 5 of 10
17. (unstack b14 b17)
   deleted: (on b14 b17) (clear b14) (arm-empty)
   added: (holding b14) (clear b17)
   goals met: 5 of 10
18. (stack b14 b4)
   deleted: (clear b4) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b4)
   goals met: 6 of 10
19. (unstack b17 b8)
   deleted: (on b17 b8) (clear b17) (arm-empty)
   added: (holding b17) (clear b8)
   goals met: 6 of 10
20. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 6 of 10
21. (unstack b8 b13)
   deleted: (on b8 b13) (clear b8) (arm-empty)
   added: (holding b8) (clear b13)
   goals met: 6 of 10
22. (stack b8 b17)
   deleted: (clear b17) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b17)
   goals met: 6 of 10
23. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 6 of 10
24. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 6 of 10
25. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 6 of 10
26. (stack b6 b14)
   deleted: (clear b14) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b14)
   goals met: 7 of 10
27. (unstack b11 b10)
   deleted: (on b11 b10) (clear b11) (arm-empty)
   added: (holding b11) (clear b10)
   goals met: 7 of 10
28. (stack b11 b13)
   deleted: (clear b13) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b13)
   goals met: 7 of 10
29. (unstack b10 b16)
   deleted: (on b10 b16) (clear b10) (arm-empty)
   added: (holding b10) (clear b16)
   goals met: 7 of 10
30. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 7 of 10
31. (unstack b16 b3)
   deleted: (on b16 b3) (clear b16) (arm-empty)
   added: (holding b16) (clear b3)
   goals met: 7 of 10
32. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 7 of 10
33. (unstack b3 b7)
   deleted: (on b3 b7) (clear b3) (arm-empty)
   added: (holding b3) (clear b7)
   goals met: 7 of 10
34. (stack b3 b19)
   deleted: (clear b19) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b19)
   goals met: 8 of 10
35. (unstack b8 b17)
   deleted: (on b8 b17) (clear b8) (arm-empty)
   added: (holding b8) (clear b17)
   goals met: 8 of 10
36. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 9 of 10
37. (unstack b11 b13)
   deleted: (on b11 b13) (clear b11) (arm-empty)
   added: (holding b11) (clear b13)
   goals met: 9 of 10
38. (stack b11 b8)
   deleted: (clear b8) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b8)
   goals met: 10 of 10
